In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import datetime as dt

In [2]:
temps = pd.read_csv('GlobalLandTemperaturesByCountry.csv')
temps.head()

           dt  AverageTemperature  AverageTemperatureUncertainty Country
0  1743-11-01               4.384                          2.294   Åland
1  1743-12-01                 NaN                            NaN   Åland
2  1744-01-01                 NaN                            NaN   Åland
3  1744-02-01                 NaN                            NaN   Åland
4  1744-03-01                 NaN                            NaN   Åland

In [3]:
us_temps = temps[temps["Country"] == "United States"]
us_temps.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
554880,1768-09-01,15.420,2.880,United States
554881,1768-10-01,8.162,3.386,United States
554882,1768-11-01,1.591,3.783,United States
554883,1768-12-01,-2.882,4.979,United States
554884,1769-01-01,-3.952,4.856,United States

In [10]:
us_temps = us_temps[us_temps["dt"] >= '1965-01-01']
us_temps

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
557236,1965-01-01,-3.194,0.120,United States
557237,1965-02-01,-3.053,0.152,United States
557238,1965-03-01,0.886,0.254,United States
557239,1965-04-01,8.701,0.157,United States
557240,1965-05-01,13.778,0.344,United States
...,...,...,...,...
557816,2013-05-01,14.073,0.178,United States
557817,2013-06-01,20.198,0.236,United States
557818,2013-07-01,22.074,0.152,United States
557819,2013-08-01,21.168,0.249,United States
557820,2013-09-01,18.273,1.210,United States

585